#+title: Contents

Brief table of contents and todo list.

* Files in Panama/_/
** TODO panama.py
Contains code common to different rounds
** DONE food_items.org
*** Final Version
Cleaned up by a human, keyed to FCT Table
#+begin_src python :results output raw table
from eep153_tools.sheets import read_sheets
from cfe.df_utils import df_to_orgtbl

food_items = read_sheets('1YwfdL0LMPVl3UGo-KfyvpC7S7KR_jDL54rsVLUQOCVE')['food_items']

food_items = food_items.set_index('Preferred Label')
food_items.to_csv('food_items.csv')

print(df_to_orgtbl(food_items,float_fmt='%d'))
#+end_src

| Preferred Label              | 2008                                                   | 2003                      | 1997 | FCT ID |
|------------------------------+--------------------------------------------------------+---------------------------+------+--------|
| Leche En Polvo               | leche en polvo                                         | Leche en polvo            |    2 |   1016 |
| Leche Líquida                | leche líquida                                          | Leche Líquida             |    3 |   1015 |
| Lecha Evaporada              | lecha evaporada                                        | Leche Evaporada           |    4 |   1014 |
| Queso (Balnco Y Amarillo)    | queso (balnco y amarillo)                              | Queso (Blanco y Amarillo) |    5 |   1028 |
| Huevos De Gallina            | huevos de gallina                                      | Huevos de Gallina         |    6 |   2002 |
| Carne De Res                 | carne de res                                           | Carne de res              |    7 |   5025 |
| Viscera De Res               | viscera de res                                         | Vísceras de res           |    8 |   5022 |
| Carnes De Puerco             | carnes de puerco                                       | Carnes de puerco          |    9 |   4003 |
| Pollo O Gallina              | pollo o gallina                                        | Pollo o gallina           |   10 |   3014 |
| Visceras De Pollo O Gallina  | visceras de pollo o gallina                            | Víscera de pollo          |   11 |   3046 |
| Embutidos                    | embutidos (jamón, mortadela, salchichas...)            | ---                       |   12 |   7008 |
| Pescados                     | pescados                                               | Pescados                  |   13 |   8032 |
| Mariscos                     | mariscos (camarones, ...)                              | Mariscos (camarones)      |   14 |   8006 |
| Sardina Y Atún               | sardina y atún (tuna)                                  | Sardina y Atún            |   15 |   8019 |
| Lentejas                     | lentejas                                               | Lenteja                   |   16 |   9029 |
| Porotos                      | porotos                                                | Porotos                   |   17 |   9012 |
| Frijoles                     | frijoles                                               | Frijoles                  |   18 |   9017 |
| Arvejas Amarillas Y Verdes   | arvejas amarillas y verdes                             | ---                       |   19 |   9001 |
| Pan De Sal Y Pan De Dulce    | pan de sal y pan de dulce                              | Pan de sal y dulce        |   21 |  14028 |
| Galletas / Pasteles Y Dulces | galletas / pasteles y dulces                           | Galletas / Dulces         |   30 |  14003 |
| Arroz(Todos)                 | arroz(todos)                                           | ---                       |   20 |  13002 |
| Maíz De Grano                | maíz de grano                                          | Maíz en grano             |   22 |  13046 |
| Maíz De Mazorca              | maíz de mazorca                                        | Maíz en mazorca           |   23 |  11074 |
| Preparación De Maíz          | preparación de maíz                                    | Preparados de maíz        |   24 |  13110 |
| Cereales Y Cremas            | cereales y cremas                                      | Cereales y cremas         |   25 |  13021 |
| Harina De Trigo              | harina de trigo                                        | Harina de trigo           |   26 |  13039 |
| Pastas Alimenticias          | pastas alimenticias (coditos, macarrones, ...)         | ---                       |   27 |  13060 |
| Azúcar (Blanca Y Morena)     | azúcar (blanca y morena)                               | ---                       |   28 |  15001 |
| Panela, Raspadura, Etc       | panela, raspadura, etc                                 | Panela, raspadura         |   29 |  15027 |
| Miel                         | miel                                                   | Miel                      |   29 |  15024 |
| Aceite Vegetal               | aceite vegetal                                         | Aceite vegetal            |   31 |  16010 |
| Manteca                      | manteca                                                | Manteca                   |  --- |  16012 |
| Mantequilla                  | mantequilla                                            | Mantequilla               |   32 |  16016 |
| Margarina                    | margarina                                              | Margarina                 |   32 |  16024 |
| Mayonesa                     | mayonesa                                               | Mayonesa                  |   63 |  16021 |
| Ajo                          | ajo                                                    | Ajo                       |   33 |  11006 |
| Culanto, Perejil, Cebollina  | culanto, perejil, cebollina                            | Culantro, perejil         |   34 |  11040 |
| Tomate                       | tomate                                                 | Tomate                    |   35 |  11157 |
| Cebolla                      | cebolla                                                | Cebolla                   |   36 |  11036 |
| Ahí Verde                    | ahí verde, pimiento y picantes                         | Ají verde, pimiento       |   37 |  11060 |
| Repollo                      | repollo                                                | Repollo                   |   38 |  11150 |
| Zanahoria                    | zanahoria                                              | Zanahoria                 |   39 |  11169 |
| Zapallo / Chayote            | zapallo / chayote                                      | Zapallo / Challote        |   40 |  11047 |
| Lechuga                      | lechuga                                                | Lechuga                   |   41 |  11105 |
| Pepino                       | pepino                                                 | Pepino                    |   42 |  11138 |
| Remolacha                    | remolacha                                              | Remolacha                 |   43 |  11147 |
| Apio                         | apio                                                   | Apio                      |   44 |  11010 |
| Papas                        | papas                                                  | Papas                     |   45 |  11127 |
| Ñame                         | Ñame                                                   | Ñame                      |   46 |  11118 |
| Yuca                         | yuca                                                   | Yuca                      |   47 |  11167 |
| Otoes                        | otoes                                                  | Otoes                     |   48 |  11112 |
| Plátanos Verdes              | plátanos verdes y/o maduros                            | ---                       |   50 |  12130 |
| Cocos (Pipas)                | cocos (pipas)                                          | Cocos                     |   49 |  12023 |
| Guineos (Bananos)            | guineos (bananos)                                      | ---                       |   51 |  12056 |
| Naranjas                     | naranjas                                               | Naranjas                  |   52 |  12105 |
| Piñas                        | piñas                                                  | Piñas                     |   53 |  12159 |
| Manzanas                     | manzanas                                               | Manzanas                  |   54 |  12086 |
| Aguacates                    | aguacates                                              | Aguacate                  |   55 |  11005 |
| Melones                      | melones                                                | Melones                   |   56 |  12096 |
| Sandias                      | sandias                                                | Sandías                   |   57 |  12134 |
| Mangos                       | mangos                                                 | Mangos                    |   58 |  12080 |
| Limones                      | limones                                                | Limones                   |   59 |  12070 |
| Papayas                      | papayas                                                | Papayas                   |   60 |  12113 |
| Alimento Infantil            | alimento infantil                                      | Alimento Infantil         |    1 |  19093 |
| Sopa Enlatada                | sopa enlatada y en sobres                              | Enlatados y envasados     |   61 |  20007 |
| Pastas De Tomate             | pastas de tomate y salsas de tomate                    | ---                       |   62 |  20071 |
| Condimentos                  | condimentos (orégano, pimienta, ...)                   | ---                       |   64 |  22017 |
| Sal                          | sal                                                    | Sal                       |   65 |  22021 |
| Sodas, Refrescos Y Jugos     | sodas, refrescos y jugos                               | Sodas y refrescos         |   66 |  17018 |
| Helados                      | helados                                                | Helados                   |   67 |  18015 |
| Raspados Y Duros             | raspados y duros                                       | Raspados y duros          |   67 |  18014 |
| Café Y Té                    | café y té                                              | Café y té                 |   68 |  17040 |
| Enlatados Y Envasados        | enlatados y envasados (maíz, frijoles, vegetales, ...) | ---                       |   72 |  11110 |
| Pastillas Y Confites         | pastillas y confites                                   | Pastillas y confites      |  --- |  15006 |
| Chocolates                   | chocolates                                             | Chocolates                |  --- |  15009 |
| Picaritas                    | picaritas, menitos, snacks, etc                        | Picaritas, snacks         |  --- |  21072 |
| Gelatinas                    | gelatinas, pudines, postres y mermeladas               | ---                       |  --- |  18011 |
| Cervezas                     | cervezas                                               | Cerveza                   |   69 |  17010 |
| Licores Varios               | licores varios                                         | Licores varios            |   70 |  17009 |
| Cigarrillo Y Tabaco          | cigarrillo y tabaco                                    | Cigarrillo y Tabaco       |   71 |    --- |
| Otros                        | otros                                                  |                           |   73 |    --- |


*** Rough Version
Should have columns for each year, with "Preferred Labels" and "Aggregate Labels".   Labels for different years:
#+begin_src python :results output raw table
from lsms.tools import from_dta
import dvc.api
import pyreadstat
from pathlib import Path


Country = str(Path().resolve().parent).split('/')[-1]

itemlabel_location = {'2008':('05alimentos.dta','producto'),
                      '2003':('E03GA10B.DTA','gai00'),
                      '1997':('GAST-A.DTA','ga100')}


reference_year = list(itemlabel_location.keys())[0]

fs = dvc.api.DVCFileSystem('../../')

itemlabels = {}
for k,v in itemlabel_location.items():
    fs.get_file(f'/{Country}/{k}/Data/{v[0]}',f'/tmp/{v[0]}')
    df, meta = pyreadstat.read_dta(f'/tmp/{v[0]}')
    try:
        itemlabels[k] = list(meta.value_labels[v[1]].values())
    except KeyError:
        itemlabels[k] = df[v[1]].astype(int).astype(str).value_counts().sort_index().index.tolist()

#print(itemlabels)

# Build dictionary of dictionaries for matching
from collections import defaultdict
import difflib
import pandas as pd
from cfe.df_utils import df_to_orgtbl

D = defaultdict(dict)
D.update({k:{'Preferred Label':k.title()} for k in itemlabels[reference_year]})

for wave in itemlabel_location.keys():
    for l in itemlabels[wave]:
        k = difflib.get_close_matches(l,itemlabels[reference_year])
        if len(k):
            D[k[0]][wave] = l
        else:
            D[l][wave] = l

df = pd.DataFrame(D).T.set_index('Preferred Label')

print(df_to_orgtbl(df))
#+end_src

#+results:
| Preferred Label                                        | 2008                                                   | 2003                      | 1997 |
|--------------------------------------------------------+--------------------------------------------------------+---------------------------+------|
| Leche En Polvo                                         | leche en polvo                                         | Leche en polvo            | ---  |
| Leche Líquida                                          | leche líquida                                          | Leche Líquida             | ---  |
| Lecha Evaporada                                        | lecha evaporada                                        | Leche Evaporada           | ---  |
| Queso (Balnco Y Amarillo)                              | queso (balnco y amarillo)                              | Queso (Blanco y Amarillo) | ---  |
| Huevos De Gallina                                      | huevos de gallina                                      | Huevos de Gallina         | ---  |
| Carne De Res                                           | carne de res                                           | Carne de res              | ---  |
| Viscera De Res                                         | viscera de res                                         | Vísceras de res           | ---  |
| Carnes De Puerco                                       | carnes de puerco                                       | Carnes de puerco          | ---  |
| Pollo O Gallina                                        | pollo o gallina                                        | Pollo o gallina           | ---  |
| Visceras De Pollo O Gallina                            | visceras de pollo o gallina                            | Víscera de pollo          | ---  |
| Embutidos (Jamón, Mortadela, Salchichas...)            | embutidos (jamón, mortadela, salchichas...)            | ---                       | ---  |
| Pescados                                               | pescados                                               | Pescados                  | ---  |
| Mariscos (Camarones, ...)                              | mariscos (camarones, ...)                              | Mariscos (camarones)      | ---  |
| Sardina Y Atún (Tuna)                                  | sardina y atún (tuna)                                  | Sardina y Atún            | ---  |
| Lentejas                                               | lentejas                                               | Lenteja                   | ---  |
| Porotos                                                | porotos                                                | Porotos                   | ---  |
| Frijoles                                               | frijoles                                               | Frijoles                  | ---  |
| Arvejas Amarillas Y Verdes                             | arvejas amarillas y verdes                             | ---                       | ---  |
| Pan De Sal Y Pan De Dulce                              | pan de sal y pan de dulce                              | Pan de sal y dulce        | ---  |
| Galletas / Pasteles Y Dulces                           | galletas / pasteles y dulces                           | Galletas / Dulces         | ---  |
| Arroz(Todos)                                           | arroz(todos)                                           | ---                       | ---  |
| Maíz De Grano                                          | maíz de grano                                          | Maíz en grano             | ---  |
| Maíz De Mazorca                                        | maíz de mazorca                                        | Maíz en mazorca           | ---  |
| Preparación De Maíz                                    | preparación de maíz                                    | Preparados de maíz        | ---  |
| Cereales Y Cremas                                      | cereales y cremas                                      | Cereales y cremas         | ---  |
| Harina De Trigo                                        | harina de trigo                                        | Harina de trigo           | ---  |
| Pastas Alimenticias (Coditos, Macarrones, ...)         | pastas alimenticias (coditos, macarrones, ...)         | ---                       | ---  |
| Azúcar (Blanca Y Morena)                               | azúcar (blanca y morena)                               | ---                       | ---  |
| Panela, Raspadura, Etc                                 | panela, raspadura, etc                                 | Panela, raspadura         | ---  |
| Miel                                                   | miel                                                   | Miel                      | ---  |
| Aceite Vegetal                                         | aceite vegetal                                         | Aceite vegetal            | ---  |
| Manteca                                                | manteca                                                | Manteca                   | ---  |
| Mantequilla                                            | mantequilla                                            | Mantequilla               | ---  |
| Margarina                                              | margarina                                              | Margarina                 | ---  |
| Mayonesa                                               | mayonesa                                               | Mayonesa                  | ---  |
| Ajo                                                    | ajo                                                    | Ajo                       | ---  |
| Culanto, Perejil, Cebollina                            | culanto, perejil, cebollina                            | Culantro, perejil         | ---  |
| Tomate                                                 | tomate                                                 | Tomate                    | ---  |
| Cebolla                                                | cebolla                                                | Cebolla                   | ---  |
| Ahí Verde, Pimiento Y Picantes                         | ahí verde, pimiento y picantes                         | Ají verde, pimiento       | ---  |
| Repollo                                                | repollo                                                | Repollo                   | ---  |
| Zanahoria                                              | zanahoria                                              | Zanahoria                 | ---  |
| Zapallo / Chayote                                      | zapallo / chayote                                      | Zapallo / Challote        | ---  |
| Lechuga                                                | lechuga                                                | Lechuga                   | ---  |
| Pepino                                                 | pepino                                                 | Pepino                    | ---  |
| Remolacha                                              | remolacha                                              | Remolacha                 | ---  |
| Apio                                                   | apio                                                   | Apio                      | ---  |
| Papas                                                  | papas                                                  | Papas                     | ---  |
| Ñame                                                   | Ñame                                                   | Ñame                      | ---  |
| Yuca                                                   | yuca                                                   | Yuca                      | ---  |
| Otoes                                                  | otoes                                                  | Otoes                     | ---  |
| Plátanos Verdes Y/O Maduros                            | plátanos verdes y/o maduros                            | ---                       | ---  |
| Cocos (Pipas)                                          | cocos (pipas)                                          | ---                       | ---  |
| Guineos (Bananos)                                      | guineos (bananos)                                      | ---                       | ---  |
| Naranjas                                               | naranjas                                               | Naranjas                  | ---  |
| Piñas                                                  | piñas                                                  | Piñas                     | ---  |
| Manzanas                                               | manzanas                                               | Manzanas                  | ---  |
| Aguacates                                              | aguacates                                              | Aguacate                  | ---  |
| Melones                                                | melones                                                | Melones                   | ---  |
| Sandias                                                | sandias                                                | Sandías                   | ---  |
| Mangos                                                 | mangos                                                 | Mangos                    | ---  |
| Limones                                                | limones                                                | Limones                   | ---  |
| Papayas                                                | papayas                                                | Papayas                   | ---  |
| Alimento Infantil                                      | alimento infantil                                      | Alimento Infantil         | ---  |
| Sopa Enlatada Y En Sobres                              | sopa enlatada y en sobres                              | Enlatados y envasados     | ---  |
| Pastas De Tomate Y Salsas De Tomate                    | pastas de tomate y salsas de tomate                    | ---                       | ---  |
| Condimentos (Orégano, Pimienta, ...)                   | condimentos (orégano, pimienta, ...)                   | ---                       | ---  |
| Sal                                                    | sal                                                    | Sal                       | ---  |
| Sodas, Refrescos Y Jugos                               | sodas, refrescos y jugos                               | Sodas y refrescos         | ---  |
| Helados                                                | helados                                                | Helados                   | ---  |
| Raspados Y Duros                                       | raspados y duros                                       | Raspados y duros          | ---  |
| Café Y Té                                              | café y té                                              | Café y té                 | ---  |
| Enlatados Y Envasados (Maíz, Frijoles, Vegetales, ...) | enlatados y envasados (maíz, frijoles, vegetales, ...) | ---                       | ---  |
| Pastillas Y Confites                                   | pastillas y confites                                   | Pastillas y confites      | ---  |
| Chocolates                                             | chocolates                                             | Chocolates                | ---  |
| Picaritas, Menitos, Snacks, Etc                        | picaritas, menitos, snacks, etc                        | Picaritas, snacks         | ---  |
| Gelatinas, Pudines, Postres Y Mermeladas               | gelatinas, pudines, postres y mermeladas               | ---                       | ---  |
| Cervezas                                               | cervezas                                               | Cerveza                   | ---  |
| Licores Varios                                         | licores varios                                         | Licores varios            | ---  |
| Cigarrillo Y Tabaco                                    | cigarrillo y tabaco                                    | Cigarrillo y Tabaco       | ---  |
| Otros                                                  | otros                                                  | Cocos                     | ---  |


** TODO conversion_to_kgs.json
** DONE nutrition
A food conversion table, with foods keyed to the "Preferred Labels" of food_items.org.   See https://docs.google.com/spreadsheets/d/1YwfdL0LMPVl3UGo-KfyvpC7S7KR_jDL54rsVLUQOCVE/, prepared by Kaylee Vu, which indexes the FCT at http://www.incap.int/mesocaribefoods/dmdocuments/TablaCAlimentos.pdf.

Code to extract the nutrient tables from the aforementioned pdf:
#+begin_src python
import camelot

# Produces a list of tables, one from each page
foo = camelot.read_pdf('TablaCAlimentos.pdf',flavor='stream',pages='26-83')

def assign_index_and_columns(df):
    idx = pd.MultiIndex.from_frame(df.iloc[3:,[0,1]])
    idx.names = ['Code','Name']
    cols = pd.MultiIndex.from_frame(df.iloc[[0,2],2:].T)
    cols.names = ['Nutrient','Unit']

    return pd.DataFrame(df.iloc[3:,2:].values,index=idx,columns=cols)

L = []
for table in foo:
    L.append(assign_index_and_columns(table.df))

D = pd.concat(L)


#+end_src

* Files in Panama/<SOMEYEAR>/_/
** DONE household_characteristics.py
** DONE food_acquired.py
** DONE nutrition.py
